# Ultralytics YOLO 🚀, AGPL-3.0 license

# Parameters
nc: 80 # number of classes
scales: 
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] 
  s: [0.33, 0.50, 1024] 
  m: [0.67, 0.75, 768] 
  l: [1.00, 1.00, 512] 
  x: [1.00, 1.25, 512]

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9

# LCFF-Net head
head:
  - [-1, 1, SCDown, [256, 1, 1]]  # 10, Y5, lateral_convs.0
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]

  - [6, 1, SCDown, [256, 1, 1]]
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, LFERELAN, [256, 1, 0.5]]
  
  - [-1, 1, SCDown, [256, 1, 1]]  # 15, Y4, lateral_convs.1
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  
  - [4, 1, SCDown, [256, 1, 1]]
  - [[-2, -1], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, LFERELAN, [256, 1, 0.5]]

  - [-1, 1, SCDown, [256, 1, 1]]  # 20, Y3, lateral_convs.1
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  
  - [2, 1, SCDown, [256, 1, 1]]
  - [[-2, -1], 1, Concat, [1]]  # cat backbone P2
  - [-1, 3, LFERELAN, [256, 2, 0.45]]

  - [-1, 1, Conv, [256, 3, 2]]  # 25, downsample_convs.0
  - [[-1, 20], 1, Concat, [1]]  # cat Y3
  - [-1, 3, LFERELAN, [256, 1, 0.5]]
  
  - [-1, 1, Conv, [256, 3, 2]]  # 28, downsample_convs.0
  - [[-1, 15], 1, Concat, [1]]  # cat Y4
  - [-1, 3, LFERELAN, [256, 1, 0.5]]

  - [[24, 27, 30], 1, Detect_LDESCD_Head, [nc, 256]] # Detect(P3, P4, P5)
