# LCFF-Net with EMA.
# Parameters
nc: 10 # number of classes
scales: # Select a specific model size by annotating the others.
  # [depth, width, max_channels]
  #a: [0.33, 0.12, 1024]
  t: [0.33, 0.16, 1024]
  #n: [0.33, 0.25, 1024]
  #s: [0.33, 0.50, 1024]
  #m: [0.40, 0.75, 768]
  #l: [0.45, 1.00, 512]
  #x: [0.50, 1.25, 512]

# LCFF-Net backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, LFERELAN, [128, 2, 0.7]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, LFERELAN, [256, 1, 0.5]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, LFERELAN, [512, 1, 0.5]] # 6
  - [-1, 1, SCDown, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, LFERELAN, [1024, 1, 0.5]] # 8
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 1, EMA, []]

# LCFF-Net head
head:
  - [-1, 1, SCDown, [256, 1, 1]] # 10
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11

  - [6, 1, SCDown, [256, 1, 1]] # 12
  - [[-2, -1], 1, Concat, [1]] # 13
  - [-1, 3, LFERELAN, [256, 1, 0.5]] # 14
  
  - [-1, 1, SCDown, [256, 1, 1]] # 15
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 16
  
  - [4, 1, SCDown, [256, 1, 1]] # 17
  - [[-2, -1], 1, Concat, [1]] # 18
  - [-1, 3, LFERELAN, [256, 1, 0.5]] # 19

  - [-1, 1, SCDown, [256, 1, 1]] # 20
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 21
  
  - [2, 1, SCDown, [256, 1, 1]] # 22
  - [[-2, -1], 1, Concat, [1]] # 23
  - [-1, 3, LFERELAN, [256, 2, 0.45]] # 24

  - [-1, 1, Conv, [256, 3, 2]] # 25
  - [[-1, 20], 1, Concat, [1]] # 26
  - [-1, 3, LFERELAN, [256, 1, 0.5]] # 27
  
  - [-1, 1, Conv, [256, 3, 2]] # 28
  - [[-1, 15], 1, Concat, [1]] # 29
  - [-1, 3, LFERELAN, [256, 1, 0.5]] # 30

  - [[25, 28, 31], 1, Detect_LDESCD_Head, [nc, 256]]

